Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/uart_reg.h
/**
  ******************************************************************************
  * @file    uart_reg.h
  * @version V1.2
  * @date    2019-10-21
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __UART_REG_H__
#define __UART_REG_H__

#include "bl602.h"

/* 0x0 : utx_config */
#define UART_UTX_CONFIG_OFFSET     (0x0)
#define UART_CR_UTX_EN             UART_CR_UTX_EN
#define UART_CR_UTX_EN_POS         (0U)
#define UART_CR_UTX_EN_LEN         (1U)
#define UART_CR_UTX_EN_MSK         (((1U << UART_CR_UTX_EN_LEN) - 1) << UART_CR_UTX_EN_POS)
#define UART_CR_UTX_EN_UMSK        (~(((1U << UART_CR_UTX_EN_LEN) - 1) << UART_CR_UTX_EN_POS))
#define UART_CR_UTX_CTS_EN         UART_CR_UTX_CTS_EN
#define UART_CR_UTX_CTS_EN_POS     (1U)
#define UART_CR_UTX_CTS_EN_LEN     (1U)
#define UART_CR_UTX_CTS_EN_MSK     (((1U << UART_CR_UTX_CTS_EN_LEN) - 1) << UART_CR_UTX_CTS_EN_POS)
#define UART_CR_UTX_CTS_EN_UMSK    (~(((1U << UART_CR_UTX_CTS_EN_LEN) - 1) << UART_CR_UTX_CTS_EN_POS))
#define UART_CR_UTX_FRM_EN         UART_CR_UTX_FRM_EN
#define UART_CR_UTX_FRM_EN_POS     (2U)
#define UART_CR_UTX_FRM_EN_LEN     (1U)
#define UART_CR_UTX_FRM_EN_MSK     (((1U << UART_CR_UTX_FRM_EN_LEN) - 1) << UART_CR_UTX_FRM_EN_POS)
#define UART_CR_UTX_FRM_EN_UMSK    (~(((1U << UART_CR_UTX_FRM_EN_LEN) - 1) << UART_CR_UTX_FRM_EN_POS))
#define UART_CR_UTX_PRT_EN         UART_CR_UTX_PRT_EN
#define UART_CR_UTX_PRT_EN_POS     (4U)
#define UART_CR_UTX_PRT_EN_LEN     (1U)
#define UART_CR_UTX_PRT_EN_MSK     (((1U << UART_CR_UTX_PRT_EN_LEN) - 1) << UART_CR_UTX_PRT_EN_POS)
#define UART_CR_UTX_PRT_EN_UMSK    (~(((1U << UART_CR_UTX_PRT_EN_LEN) - 1) << UART_CR_UTX_PRT_EN_POS))
#define UART_CR_UTX_PRT_SEL        UART_CR_UTX_PRT_SEL
#define UART_CR_UTX_PRT_SEL_POS    (5U)
#define UART_CR_UTX_PRT_SEL_LEN    (1U)
#define UART_CR_UTX_PRT_SEL_MSK    (((1U << UART_CR_UTX_PRT_SEL_LEN) - 1) << UART_CR_UTX_PRT_SEL_POS)
#define UART_CR_UTX_PRT_SEL_UMSK   (~(((1U << UART_CR_UTX_PRT_SEL_LEN) - 1) << UART_CR_UTX_PRT_SEL_POS))
#define UART_CR_UTX_IR_EN          UART_CR_UTX_IR_EN
#define UART_CR_UTX_IR_EN_POS      (6U)
#define UART_CR_UTX_IR_EN_LEN      (1U)
#define UART_CR_UTX_IR_EN_MSK      (((1U << UART_CR_UTX_IR_EN_LEN) - 1) << UART_CR_UTX_IR_EN_POS)
#define UART_CR_UTX_IR_EN_UMSK     (~(((1U << UART_CR_UTX_IR_EN_LEN) - 1) << UART_CR_UTX_IR_EN_POS))
#define UART_CR_UTX_IR_INV         UART_CR_UTX_IR_INV
#define UART_CR_UTX_IR_INV_POS     (7U)
#define UART_CR_UTX_IR_INV_LEN     (1U)
#define UART_CR_UTX_IR_INV_MSK     (((1U << UART_CR_UTX_IR_INV_LEN) - 1) << UART_CR_UTX_IR_INV_POS)
#define UART_CR_UTX_IR_INV_UMSK    (~(((1U << UART_CR_UTX_IR_INV_LEN) - 1) << UART_CR_UTX_IR_INV_POS))
#define UART_CR_UTX_BIT_CNT_D      UART_CR_UTX_BIT_CNT_D
#define UART_CR_UTX_BIT_CNT_D_POS  (8U)
#define UART_CR_UTX_BIT_CNT_D_LEN  (3U)
#define UART_CR_UTX_BIT_CNT_D_MSK  (((1U << UART_CR_UTX_BIT_CNT_D_LEN) - 1) << UART_CR_UTX_BIT_CNT_D_POS)
#define UART_CR_UTX_BIT_CNT_D_UMSK (~(((1U << UART_CR_UTX_BIT_CNT_D_LEN) - 1) << UART_CR_UTX_BIT_CNT_D_POS))
#define UART_CR_UTX_BIT_CNT_P      UART_CR_UTX_BIT_CNT_P
#define UART_CR_UTX_BIT_CNT_P_POS  (12U)
#define UART_CR_UTX_BIT_CNT_P_LEN  (2U)
#define UART_CR_UTX_BIT_CNT_P_MSK  (((1U << UART_CR_UTX_BIT_CNT_P_LEN) - 1) << UART_CR_UTX_BIT_CNT_P_POS)
#define UART_CR_UTX_BIT_CNT_P_UMSK (~(((1U << UART_CR_UTX_BIT_CNT_P_LEN) - 1) << UART_CR_UTX_BIT_CNT_P_POS))
#define UART_CR_UTX_LEN            UART_CR_UTX_LEN
#define UART_CR_UTX_LEN_POS        (16U)
#define UART_CR_UTX_LEN_LEN        (16U)
#define UART_CR_UTX_LEN_MSK        (((1U << UART_CR_UTX_LEN_LEN) - 1) << UART_CR_UTX_LEN_POS)
#define UART_CR_UTX_LEN_UMSK       (~(((1U << UART_CR_UTX_LEN_LEN) - 1) << UART_CR_UTX_LEN_POS))

/* 0x4 : urx_config */
#define UART_URX_CONFIG_OFFSET       (0x4)
#define UART_CR_URX_EN               UART_CR_URX_EN
#define UART_CR_URX_EN_POS           (0U)
#define UART_CR_URX_EN_LEN           (1U)
#define UART_CR_URX_EN_MSK           (((1U << UART_CR_URX_EN_LEN) - 1) << UART_CR_URX_EN_POS)
#define UART_CR_URX_EN_UMSK          (~(((1U << UART_CR_URX_EN_LEN) - 1) << UART_CR_URX_EN_POS))
#define UART_CR_URX_RTS_SW_MODE      UART_CR_URX_RTS_SW_MODE
#define UART_CR_URX_RTS_SW_MODE_POS  (1U)
#define UART_CR_URX_RTS_SW_MODE_LEN  (1U)
#define UART_CR_URX_RTS_SW_MODE_MSK  (((1U << UART_CR_URX_RTS_SW_MODE_LEN) - 1) << UART_CR_URX_RTS_SW_MODE_POS)
#define UART_CR_URX_RTS_SW_MODE_UMSK (~(((1U << UART_CR_URX_RTS_SW_MODE_LEN) - 1) << UART_CR_URX_RTS_SW_MODE_POS))
#define UART_CR_URX_RTS_SW_VAL       UART_CR_URX_RTS_SW_VAL
#define UART_CR_URX_RTS_SW_VAL_POS   (2U)
#define UART_CR_URX_RTS_SW_VAL_LEN   (1U)
#define UART_CR_URX_RTS_SW_VAL_MSK   (((1U << UART_CR_URX_RTS_SW_VAL_LEN) - 1) << UART_CR_URX_RTS_SW_VAL_POS)
#define UART_CR_URX_RTS_SW_VAL_UMSK  (~(((1U << UART_CR_URX_RTS_SW_VAL_LEN) - 1) << UART_CR_URX_RTS_SW_VAL_POS))
#define UART_CR_URX_ABR_EN           UART_CR_URX_ABR_EN
#define UART_CR_URX_ABR_EN_POS       (3U)
#define UART_CR_URX_ABR_EN_LEN       (1U)
#define UART_CR_URX_ABR_EN_MSK       (((1U << UART_CR_URX_ABR_EN_LEN) - 1) << UART_CR_URX_ABR_EN_POS)
#define UART_CR_URX_ABR_EN_UMSK      (~(((1U << UART_CR_URX_ABR_EN_LEN) - 1) << UART_CR_URX_ABR_EN_POS))
#define UART_CR_URX_PRT_EN           UART_CR_URX_PRT_EN
#define UART_CR_URX_PRT_EN_POS       (4U)
#define UART_CR_URX_PRT_EN_LEN       (1U)
#define UART_CR_URX_PRT_EN_MSK       (((1U << UART_CR_URX_PRT_EN_LEN) - 1) << UART_CR_URX_PRT_EN_POS)
#define UART_CR_URX_PRT_EN_UMSK      (~(((1U << UART_CR_URX_PRT_EN_LEN) - 1) << UART_CR_URX_PRT_EN_POS))
#define UART_CR_URX_PRT_SEL          UART_CR_URX_PRT_SEL
#define UART_CR_URX_PRT_SEL_POS      (5U)
#define UART_CR_URX_PRT_SEL_LEN      (1U)
#define UART_CR_URX_PRT_SEL_MSK      (((1U << UART_CR_URX_PRT_SEL_LEN) - 1) << UART_CR_URX_PRT_SEL_POS)
#define UART_CR_URX_PRT_SEL_UMSK     (~(((1U << UART_CR_URX_PRT_SEL_LEN) - 1) << UART_CR_URX_PRT_SEL_POS))
#define UART_CR_URX_IR_EN            UART_CR_URX_IR_EN
#define UART_CR_URX_IR_EN_POS        (6U)
#define UART_CR_URX_IR_EN_LEN        (1U)
#define UART_CR_URX_IR_EN_MSK        (((1U << UART_CR_URX_IR_EN_LEN) - 1) << UART_CR_URX_IR_EN_POS)
#define UART_CR_URX_IR_EN_UMSK       (~(((1U << UART_CR_URX_IR_EN_LEN) - 1) << UART_CR_URX_IR_EN_POS))
#define UART_CR_URX_IR_INV           UART_CR_URX_IR_INV
#define UART_CR_URX_IR_INV_POS       (7U)
#define UART_CR_URX_IR_INV_LEN       (1U)
#define UART_CR_URX_IR_INV_MSK       (((1U << UART_CR_URX_IR_INV_LEN) - 1) << UART_CR_URX_IR_INV_POS)
#define UART_CR_URX_IR_INV_UMSK      (~(((1U << UART_CR_URX_IR_INV_LEN) - 1) << UART_CR_URX_IR_INV_POS))
#define UART_CR_URX_BIT_CNT_D        UART_CR_URX_BIT_CNT_D
#define UART_CR_URX_BIT_CNT_D_POS    (8U)
#define UART_CR_URX_BIT_CNT_D_LEN    (3U)
#define UART_CR_URX_BIT_CNT_D_MSK    (((1U << UART_CR_URX_BIT_CNT_D_LEN) - 1) << UART_CR_URX_BIT_CNT_D_POS)
#define UART_CR_URX_BIT_CNT_D_UMSK   (~(((1U << UART_CR_URX_BIT_CNT_D_LEN) - 1) << UART_CR_URX_BIT_CNT_D_POS))
#define UART_CR_URX_DEG_EN           UART_CR_URX_DEG_EN
#define UART_CR_URX_DEG_EN_POS       (11U)
#define UART_CR_URX_DEG_EN_LEN       (1U)
#define UART_CR_URX_DEG_EN_MSK       (((1U << UART_CR_URX_DEG_EN_LEN) - 1) << UART_CR_URX_DEG_EN_POS)
#define UART_CR_URX_DEG_EN_UMSK      (~(((1U << UART_CR_URX_DEG_EN_LEN) - 1) << UART_CR_URX_DEG_EN_POS))
#define UART_CR_URX_DEG_CNT          UART_CR_URX_DEG_CNT
#define UART_CR_URX_DEG_CNT_POS      (12U)
#define UART_CR_URX_DEG_CNT_LEN      (4U)
#define UART_CR_URX_DEG_CNT_MSK      (((1U << UART_CR_URX_DEG_CNT_LEN) - 1) << UART_CR_URX_DEG_CNT_POS)
#define UART_CR_URX_DEG_CNT_UMSK     (~(((1U << UART_CR_URX_DEG_CNT_LEN) - 1) << UART_CR_URX_DEG_CNT_POS))
#define UART_CR_URX_LEN              UART_CR_URX_LEN
#define UART_CR_URX_LEN_POS          (16U)
#define UART_CR_URX_LEN_LEN          (16U)
#define UART_CR_URX_LEN_MSK          (((1U << UART_CR_URX_LEN_LEN) - 1) << UART_CR_URX_LEN_POS)
#define UART_CR_URX_LEN_UMSK         (~(((1U << UART_CR_URX_LEN_LEN) - 1) << UART_CR_URX_LEN_POS))

/* 0x8 : uart_bit_prd */
#define UART_BIT_PRD_OFFSET      (0x8)
#define UART_CR_UTX_BIT_PRD      UART_CR_UTX_BIT_PRD
#define UART_CR_UTX_BIT_PRD_POS  (0U)
#define UART_CR_UTX_BIT_PRD_LEN  (16U)
#define UART_CR_UTX_BIT_PRD_MSK  (((1U << UART_CR_UTX_BIT_PRD_LEN) - 1) << UART_CR_UTX_BIT_PRD_POS)
#define UART_CR_UTX_BIT_PRD_UMSK (~(((1U << UART_CR_UTX_BIT_PRD_LEN) - 1) << UART_CR_UTX_BIT_PRD_POS))
#define UART_CR_URX_BIT_PRD      UART_CR_URX_BIT_PRD
#define UART_CR_URX_BIT_PRD_POS  (16U)
#define UART_CR_URX_BIT_PRD_LEN  (16U)
#define UART_CR_URX_BIT_PRD_MSK  (((1U << UART_CR_URX_BIT_PRD_LEN) - 1) << UART_CR_URX_BIT_PRD_POS)
#define UART_CR_URX_BIT_PRD_UMSK (~(((1U << UART_CR_URX_BIT_PRD_LEN) - 1) << UART_CR_URX_BIT_PRD_POS))

/* 0xC : data_config */
#define UART_DATA_CONFIG_OFFSET   (0xC)
#define UART_CR_UART_BIT_INV      UART_CR_UART_BIT_INV
#define UART_CR_UART_BIT_INV_POS  (0U)
#define UART_CR_UART_BIT_INV_LEN  (1U)
#define UART_CR_UART_BIT_INV_MSK  (((1U << UART_CR_UART_BIT_INV_LEN) - 1) << UART_CR_UART_BIT_INV_POS)
#define UART_CR_UART_BIT_INV_UMSK (~(((1U << UART_CR_UART_BIT_INV_LEN) - 1) << UART_CR_UART_BIT_INV_POS))

/* 0x10 : utx_ir_position */
#define UART_UTX_IR_POSITION_OFFSET (0x10)
#define UART_CR_UTX_IR_POS_S        UART_CR_UTX_IR_POS_S
#define UART_CR_UTX_IR_POS_S_POS    (0U)
#define UART_CR_UTX_IR_POS_S_LEN    (16U)
#define UART_CR_UTX_IR_POS_S_MSK    (((1U << UART_CR_UTX_IR_POS_S_LEN) - 1) << UART_CR_UTX_IR_POS_S_POS)
#define UART_CR_UTX_IR_POS_S_UMSK   (~(((1U << UART_CR_UTX_IR_POS_S_LEN) - 1) << UART_CR_UTX_IR_POS_S_POS))
#define UART_CR_UTX_IR_POS_P        UART_CR_UTX_IR_POS_P
#define UART_CR_UTX_IR_POS_P_POS    (16U)
#define UART_CR_UTX_IR_POS_P_LEN    (16U)
#define UART_CR_UTX_IR_POS_P_MSK    (((1U << UART_CR_UTX_IR_POS_P_LEN) - 1) << UART_CR_UTX_IR_POS_P_POS)
#define UART_CR_UTX_IR_POS_P_UMSK   (~(((1U << UART_CR_UTX_IR_POS_P_LEN) - 1) << UART_CR_UTX_IR_POS_P_POS))

/* 0x14 : urx_ir_position */
#define UART_URX_IR_POSITION_OFFSET (0x14)
#define UART_CR_URX_IR_POS_S        UART_CR_URX_IR_POS_S
#define UART_CR_URX_IR_POS_S_POS    (0U)
#define UART_CR_URX_IR_POS_S_LEN    (16U)
#define UART_CR_URX_IR_POS_S_MSK    (((1U << UART_CR_URX_IR_POS_S_LEN) - 1) << UART_CR_URX_IR_POS_S_POS)
#define UART_CR_URX_IR_POS_S_UMSK   (~(((1U << UART_CR_URX_IR_POS_S_LEN) - 1) << UART_CR_URX_IR_POS_S_POS))

/* 0x18 : urx_rto_timer */
#define UART_URX_RTO_TIMER_OFFSET  (0x18)
#define UART_CR_URX_RTO_VALUE      UART_CR_URX_RTO_VALUE
#define UART_CR_URX_RTO_VALUE_POS  (0U)
#define UART_CR_URX_RTO_VALUE_LEN  (8U)
#define UART_CR_URX_RTO_VALUE_MSK  (((1U << UART_CR_URX_RTO_VALUE_LEN) - 1) << UART_CR_URX_RTO_VALUE_POS)
#define UART_CR_URX_RTO_VALUE_UMSK (~(((1U << UART_CR_URX_RTO_VALUE_LEN) - 1) << UART_CR_URX_RTO_VALUE_POS))

/* 0x20 : UART interrupt status */
#define UART_INT_STS_OFFSET    (0x20)
#define UART_UTX_END_INT       UART_UTX_END_INT
#define UART_UTX_END_INT_POS   (0U)
#define UART_UTX_END_INT_LEN   (1U)
#define UART_UTX_END_INT_MSK   (((1U << UART_UTX_END_INT_LEN) - 1) << UART_UTX_END_INT_POS)
#define UART_UTX_END_INT_UMSK  (~(((1U << UART_UTX_END_INT_LEN) - 1) << UART_UTX_END_INT_POS))
#define UART_URX_END_INT       UART_URX_END_INT
#define UART_URX_END_INT_POS   (1U)
#define UART_URX_END_INT_LEN   (1U)
#define UART_URX_END_INT_MSK   (((1U << UART_URX_END_INT_LEN) - 1) << UART_URX_END_INT_POS)
#define UART_URX_END_INT_UMSK  (~(((1U << UART_URX_END_INT_LEN) - 1) << UART_URX_END_INT_POS))
#define UART_UTX_FIFO_INT      UART_UTX_FIFO_INT
#define UART_UTX_FIFO_INT_POS  (2U)
#define UART_UTX_FIFO_INT_LEN  (1U)
#define UART_UTX_FIFO_INT_MSK  (((1U << UART_UTX_FIFO_INT_LEN) - 1) << UART_UTX_FIFO_INT_POS)
#define UART_UTX_FIFO_INT_UMSK (~(((1U << UART_UTX_FIFO_INT_LEN) - 1) << UART_UTX_FIFO_INT_POS))
#define UART_URX_FIFO_INT      UART_URX_FIFO_INT
#define UART_URX_FIFO_INT_POS  (3U)
#define UART_URX_FIFO_INT_LEN  (1U)
#define UART_URX_FIFO_INT_MSK  (((1U << UART_URX_FIFO_INT_LEN) - 1) << UART_URX_FIFO_INT_POS)
#define UART_URX_FIFO_INT_UMSK (~(((1U << UART_URX_FIFO_INT_LEN) - 1) << UART_URX_FIFO_INT_POS))
#define UART_URX_RTO_INT       UART_URX_RTO_INT
#define UART_URX_RTO_INT_POS   (4U)
#define UART_URX_RTO_INT_LEN   (1U)
#define UART_URX_RTO_INT_MSK   (((1U << UART_URX_RTO_INT_LEN) - 1) << UART_URX_RTO_INT_POS)
#define UART_URX_RTO_INT_UMSK  (~(((1U << UART_URX_RTO_INT_LEN) - 1) << UART_URX_RTO_INT_POS))
#define UART_URX_PCE_INT       UART_URX_PCE_INT
#define UART_URX_PCE_INT_POS   (5U)
#define UART_URX_PCE_INT_LEN   (1U)
#define UART_URX_PCE_INT_MSK   (((1U << UART_URX_PCE_INT_LEN) - 1) << UART_URX_PCE_INT_POS)
#define UART_URX_PCE_INT_UMSK  (~(((1U << UART_URX_PCE_INT_LEN) - 1) << UART_URX_PCE_INT_POS))
#define UART_UTX_FER_INT       UART_UTX_FER_INT
#define UART_UTX_FER_INT_POS   (6U)
#define UART_UTX_FER_INT_LEN   (1U)
#define UART_UTX_FER_INT_MSK   (((1U << UART_UTX_FER_INT_LEN) - 1) << UART_UTX_FER_INT_POS)
#define UART_UTX_FER_INT_UMSK  (~(((1U << UART_UTX_FER_INT_LEN) - 1) << UART_UTX_FER_INT_POS))
#define UART_URX_FER_INT       UART_URX_FER_INT
#define UART_URX_FER_INT_POS   (7U)
#define UART_URX_FER_INT_LEN   (1U)
#define UART_URX_FER_INT_MSK   (((1U << UART_URX_FER_INT_LEN) - 1) << UART_URX_FER_INT_POS)
#define UART_URX_FER_INT_UMSK  (~(((1U << UART_URX_FER_INT_LEN) - 1) << UART_URX_FER_INT_POS))

/* 0x24 : UART interrupt mask */
#define UART_INT_MASK_OFFSET       (0x24)
#define UART_CR_UTX_END_MASK       UART_CR_UTX_END_MASK
#define UART_CR_UTX_END_MASK_POS   (0U)
#define UART_CR_UTX_END_MASK_LEN   (1U)
#define UART_CR_UTX_END_MASK_MSK   (((1U << UART_CR_UTX_END_MASK_LEN) - 1) << UART_CR_UTX_END_MASK_POS)
#define UART_CR_UTX_END_MASK_UMSK  (~(((1U << UART_CR_UTX_END_MASK_LEN) - 1) << UART_CR_UTX_END_MASK_POS))
#define UART_CR_URX_END_MASK       UART_CR_URX_END_MASK
#define UART_CR_URX_END_MASK_POS   (1U)
#define UART_CR_URX_END_MASK_LEN   (1U)
#define UART_CR_URX_END_MASK_MSK   (((1U << UART_CR_URX_END_MASK_LEN) - 1) << UART_CR_URX_END_MASK_POS)
#define UART_CR_URX_END_MASK_UMSK  (~(((1U << UART_CR_URX_END_MASK_LEN) - 1) << UART_CR_URX_END_MASK_POS))
#define UART_CR_UTX_FIFO_MASK      UART_CR_UTX_FIFO_MASK
#define UART_CR_UTX_FIFO_MASK_POS  (2U)
#define UART_CR_UTX_FIFO_MASK_LEN  (1U)
#define UART_CR_UTX_FIFO_MASK_MSK  (((1U << UART_CR_UTX_FIFO_MASK_LEN) - 1) << UART_CR_UTX_FIFO_MASK_POS)
#define UART_CR_UTX_FIFO_MASK_UMSK (~(((1U << UART_CR_UTX_FIFO_MASK_LEN) - 1) << UART_CR_UTX_FIFO_MASK_POS))
#define UART_CR_URX_FIFO_MASK      UART_CR_URX_FIFO_MASK
#define UART_CR_URX_FIFO_MASK_POS  (3U)
#define UART_CR_URX_FIFO_MASK_LEN  (1U)
#define UART_CR_URX_FIFO_MASK_MSK  (((1U << UART_CR_URX_FIFO_MASK_LEN) - 1) << UART_CR_URX_FIFO_MASK_POS)
#define UART_CR_URX_FIFO_MASK_UMSK (~(((1U << UART_CR_URX_FIFO_MASK_LEN) - 1) << UART_CR_URX_FIFO_MASK_POS))
#define UART_CR_URX_RTO_MASK       UART_CR_URX_RTO_MASK
#define UART_CR_URX_RTO_MASK_POS   (4U)
#define UART_CR_URX_RTO_MASK_LEN   (1U)
#define UART_CR_URX_RTO_MASK_MSK   (((1U << UART_CR_URX_RTO_MASK_LEN) - 1) << UART_CR_URX_RTO_MASK_POS)
#define UART_CR_URX_RTO_MASK_UMSK  (~(((1U << UART_CR_URX_RTO_MASK_LEN) - 1) << UART_CR_URX_RTO_MASK_POS))
#define UART_CR_URX_PCE_MASK       UART_CR_URX_PCE_MASK
#define UART_CR_URX_PCE_MASK_POS   (5U)
#define UART_CR_URX_PCE_MASK_LEN   (1U)
#define UART_CR_URX_PCE_MASK_MSK   (((1U << UART_CR_URX_PCE_MASK_LEN) - 1) << UART_CR_URX_PCE_MASK_POS)
#define UART_CR_URX_PCE_MASK_UMSK  (~(((1U << UART_CR_URX_PCE_MASK_LEN) - 1) << UART_CR_URX_PCE_MASK_POS))
#define UART_CR_UTX_FER_MASK       UART_CR_UTX_FER_MASK
#define UART_CR_UTX_FER_MASK_POS   (6U)
#define UART_CR_UTX_FER_MASK_LEN   (1U)
#define UART_CR_UTX_FER_MASK_MSK   (((1U << UART_CR_UTX_FER_MASK_LEN) - 1) << UART_CR_UTX_FER_MASK_POS)
#define UART_CR_UTX_FER_MASK_UMSK  (~(((1U << UART_CR_UTX_FER_MASK_LEN) - 1) << UART_CR_UTX_FER_MASK_POS))
#define UART_CR_URX_FER_MASK       UART_CR_URX_FER_MASK
#define UART_CR_URX_FER_MASK_POS   (7U)
#define UART_CR_URX_FER_MASK_LEN   (1U)
#define UART_CR_URX_FER_MASK_MSK   (((1U << UART_CR_URX_FER_MASK_LEN) - 1) << UART_CR_URX_FER_MASK_POS)
#define UART_CR_URX_FER_MASK_UMSK  (~(((1U << UART_CR_URX_FER_MASK_LEN) - 1) << UART_CR_URX_FER_MASK_POS))

