Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/uart_reg.h
/* 0x88 : uart_fifo_wdata */
#define UART_FIFO_WDATA_OFFSET (0x88)
#define UART_FIFO_WDATA        UART_FIFO_WDATA
#define UART_FIFO_WDATA_POS    (0U)
#define UART_FIFO_WDATA_LEN    (8U)
#define UART_FIFO_WDATA_MSK    (((1U << UART_FIFO_WDATA_LEN) - 1) << UART_FIFO_WDATA_POS)
#define UART_FIFO_WDATA_UMSK   (~(((1U << UART_FIFO_WDATA_LEN) - 1) << UART_FIFO_WDATA_POS))

/* 0x8C : uart_fifo_rdata */
#define UART_FIFO_RDATA_OFFSET (0x8C)
#define UART_FIFO_RDATA        UART_FIFO_RDATA
#define UART_FIFO_RDATA_POS    (0U)
#define UART_FIFO_RDATA_LEN    (8U)
#define UART_FIFO_RDATA_MSK    (((1U << UART_FIFO_RDATA_LEN) - 1) << UART_FIFO_RDATA_POS)
#define UART_FIFO_RDATA_UMSK   (~(((1U << UART_FIFO_RDATA_LEN) - 1) << UART_FIFO_RDATA_POS))

struct uart_reg {
    /* 0x0 : utx_config */
    union {
        struct
        {
            uint32_t cr_utx_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_utx_cts_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_utx_frm_en    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_utx_prt_en    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_utx_prt_sel   : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_utx_ir_en     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_utx_ir_inv    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_utx_bit_cnt_d : 3;  /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11      : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t cr_utx_bit_cnt_p : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14_15   : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t cr_utx_len       : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } utx_config;

    /* 0x4 : urx_config */
    union {
        struct
        {
            uint32_t cr_urx_en          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_urx_rts_sw_mode : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_urx_rts_sw_val  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_urx_abr_en      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_urx_prt_en      : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_urx_prt_sel     : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_urx_ir_en       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_urx_ir_inv      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_urx_bit_cnt_d   : 3;  /* [10: 8],        r/w,        0x7 */
            uint32_t cr_urx_deg_en      : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_urx_deg_cnt     : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t cr_urx_len         : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_config;

    /* 0x8 : uart_bit_prd */
    union {
        struct
        {
            uint32_t cr_utx_bit_prd : 16; /* [15: 0],        r/w,       0xff */
            uint32_t cr_urx_bit_prd : 16; /* [31:16],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } uart_bit_prd;

    /* 0xC : data_config */
    union {
        struct
        {
            uint32_t cr_uart_bit_inv : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31   : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } data_config;

    /* 0x10 : utx_ir_position */
    union {
        struct
        {
            uint32_t cr_utx_ir_pos_s : 16; /* [15: 0],        r/w,       0x70 */
            uint32_t cr_utx_ir_pos_p : 16; /* [31:16],        r/w,       0x9f */
        } BF;
        uint32_t WORD;
    } utx_ir_position;

    /* 0x14 : urx_ir_position */
    union {
        struct
        {
            uint32_t cr_urx_ir_pos_s : 16; /* [15: 0],        r/w,       0x6f */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_ir_position;

    /* 0x18 : urx_rto_timer */
    union {
        struct
        {
            uint32_t cr_urx_rto_value : 8;  /* [ 7: 0],        r/w,        0xf */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_rto_timer;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[4];

    /* 0x20 : UART interrupt status */
    union {
        struct
        {
            uint32_t utx_end_int   : 1;  /* [    0],          r,        0x0 */
            uint32_t urx_end_int   : 1;  /* [    1],          r,        0x0 */
            uint32_t utx_fifo_int  : 1;  /* [    2],          r,        0x0 */
            uint32_t urx_fifo_int  : 1;  /* [    3],          r,        0x0 */
            uint32_t urx_rto_int   : 1;  /* [    4],          r,        0x0 */
            uint32_t urx_pce_int   : 1;  /* [    5],          r,        0x0 */
            uint32_t utx_fer_int   : 1;  /* [    6],          r,        0x0 */
            uint32_t urx_fer_int   : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_sts;

    /* 0x24 : UART interrupt mask */
    union {
        struct
        {
            uint32_t cr_utx_end_mask  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_urx_end_mask  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_utx_fifo_mask : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_urx_fifo_mask : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_urx_rto_mask  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_urx_pce_mask  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_utx_fer_mask  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_urx_fer_mask  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_mask;

